{
  "backend/main.mo": "Defines actor with product, order, wallet, user, and authorization types, state maps, comparators, and admin‑protected product management functions.",
  "feature_evidence.json": "Contains structured feature evidence records mapping requested features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind base variables and theme definitions for light/dark modes using OKLCH values.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps app in AppShell and ThemeProvider, and protects routes with AuthGate/AdminGate.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access denied card with warning icon and button to return home.",
  "frontend/src/components/auth/AdminGate.tsx": "Checks user role and identity, showing admin content, claim-access screen, or access‑denied accordingly.",
  "frontend/src/components/auth/AuthGate.tsx": "Redirects unauthenticated users to login and displays a loader during identity initialization.",
  "frontend/src/components/auth/ClaimAdminAccessScreen.tsx": "Login form for claiming admin access using username and password with mutation handling and error display.",
  "frontend/src/components/catalog/ProductCard.tsx": "Displays a product card with icon, name, price, and optional auto‑delivery badge.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper with header, main outlet, and footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer showing social links, app download badge, support info, and attribution.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Navigation header with logo, links, auth handling, and user/admin dropdown menus.",
  "frontend/src/components/promo/InstallAppBar.tsx": "Bottom install prompt bar shown until dismissed using localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous actor instance and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Admin hooks for fetching, approving, and rejecting wallet top‑up transactions with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/clear functions, and status management.",
  "frontend/src/hooks/useOrders.ts": "Hooks for fetching caller orders, creating orders, and fetching all orders with cache updates.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user data, products, roles, and admin access through the actor API.",
  "frontend/src/hooks/useTransactions.ts": "Provides a mutation hook to submit wallet top‑up transactions and invalidate related queries.",
  "frontend/src/hooks/useWallet.ts": "Hooks for fetching the caller's wallet balance and wallet top‑up transactions using the actor API.",
  "frontend/src/index.css": "TailwindCSS base styles, theme variables, and custom utility classes for a purple‑accent UI theme.",
  "frontend/src/main.tsx": "App entry that mounts React, sets up QueryClientProvider, and wraps the app with InternetIdentityProvider.",
  "frontend/src/pages/AddMoneyPage.tsx": "UI for submitting wallet top‑ups, displaying balance, listing transactions, and handling form submission.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Admin interface showing transactions, orders, and users with actions to approve or reject transactions.",
  "frontend/src/pages/ContactUsPage.tsx": "Static contact page showing Telegram and email support details.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing balance, transactions, orders, and a profile setup dialog if profile is missing.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, promotional offers, and product listings fetched via useGetProducts.",
  "frontend/src/pages/IdCodeTopUpPage.tsx": "UI page for selecting diamond packages and entering a Free Fire UID, showing payment instructions once UID is provided.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with disabled email/password fields and auto-redirect on successful auth.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with disabled input fields that triggers Internet Identity login and redirects on success.",
  "frontend/src/pages/TopupPage.tsx": "Displays a list of top-up products and handles navigation or order creation depending on authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, and clearing URL and session-stored parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color system, extended animations, shadows, and typography/container/animate plugins.",
  "project_state.json": "Project state metadata describing Add Money page UI updates, instructions, required icons, and existing feature requirements."
}