{
  "backend/main.mo": "Defines the actor’s core data models and state for orders, wallet transactions, points, diamonds, products, and access control.",
  "backend/migration.mo": "Provides type definitions and a no-op migration function that returns the old actor state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI style of various frontend files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH-driven color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, AuthGate/AdminGate protection, and global ThemeProvider.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access-denied message with a button to return home.",
  "frontend/src/components/auth/AdminGate.tsx": "Checks identity and admin role, showing loading, denied, claim, or wrapped admin content accordingly.",
  "frontend/src/components/auth/AuthGate.tsx": "Redirects unauthenticated users to login and shows a loader while identity initializes.",
  "frontend/src/components/auth/ClaimAdminAccessScreen.tsx": "Displays a form for claiming admin access using username and password with mutation handling.",
  "frontend/src/components/catalog/ProductCard.tsx": "Renders a clickable product card with icon, name, price, and optional auto-delivery badge.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, routed content, and footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Shows a footer with contact info, social links, legal links, and branding.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Provides the main site navigation with auth state handling, user menu, and wallet balance display.",
  "frontend/src/components/payments/PaymentMethodModal.tsx": "Modal for submitting bKash or Nagad payment details including amount and transaction ID.",
  "frontend/src/components/promo/InstallAppBar.tsx": "Displays a dismissible install prompt bar encouraging users to install the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, reinitializing and invalidating queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides React Query hooks for admins to fetch, approve, and reject wallet top‑up transactions with cache invalidation.",
  "frontend/src/hooks/useAdminPoints.ts": "Contains admin hooks for managing points transactions, purchase requests, diamond purchases, analytics, dashboard stats, and conversion settings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook for managing login, identity loading, and status tracking via Dfinity AuthClient.",
  "frontend/src/hooks/useOrders.ts": "Defines placeholder order‑related hooks returning empty data until backend support is added.",
  "frontend/src/hooks/usePoints.ts": "Provides hooks for fetching and mutating caller points data including balances, transactions, purchase requests, diamond purchases, and ad rewards.",
  "frontend/src/hooks/useQueries.ts": "Offers hooks for products, user profiles, user roles, user lists, and admin access with React Query integration.",
  "frontend/src/hooks/useTransactions.ts": "Hook for submitting wallet add‑money transactions and invalidating related queries.",
  "frontend/src/hooks/useWallet.ts": "Provides hooks to fetch the caller's wallet balance and top‑up transactions.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode colors, and custom UI utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddMoneyPage.tsx": "Shows wallet balance, transaction history, and provides modal-driven flow for submitting add-money transactions via bkash or nagad.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Admin dashboard displaying transactions, orders, users, analytics, and conversion settings with approve/reject actions.",
  "frontend/src/pages/AdRewardsPage.tsx": "Displays points balance, daily ad progress, and lets users watch ads to earn points with limit checks and reward mutation.",
  "frontend/src/pages/BuyDiamondsWithPointsPage.tsx": "Allows users to convert points into diamonds based on conversion settings and submit purchase requests.",
  "frontend/src/pages/BuyPointsPage.tsx": "Enables users to buy points using wallet balance, submit purchase requests with transaction IDs, and view past requests.",
  "frontend/src/pages/ContactUsPage.tsx": "Static contact page offering Telegram and email support info.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing wallet, points, orders, transactions, and a profile setup dialog if profile is missing.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, promotional badges, a CTA to add money, and a new-offer card along with predefined Free Fire product items.",
  "frontend/src/pages/IdCodeTopUpPage.tsx": "Page for selecting a diamond package and entering a player UID, conditionally showing payment instructions.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity, redirecting authenticated users to the dashboard.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with disabled form fields that relies on Internet Identity login to create an account.",
  "frontend/src/pages/TopupPage.tsx": "Product selection page for top-ups, handling ID-code navigation, authentication checks, and order creation with toasts.",
  "frontend/src/utils/transactionId.ts": "Generates a unique transaction ID using a timestamp and random string.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL query or hash parameters, persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Describes the project’s state, requirements, features, and pending Add Money workflow tasks."
}