{
  "backend/main.mo": "Defines actor state, types, and data structures for products, orders, wallets, points, diamonds, admin stats, and authorization mixins.",
  "feature_evidence.json": "Report listing implemented UI features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Human‑written summaries describing purpose and styling of various frontend components and pages.",
  "frontend/index.css": "Global Tailwind base/theme variables using OKLCH colors, setting light/dark tokens and default background/foreground styles.",
  "frontend/index.html": "HTML entry file providing the root element and loading the React app bundle.",
  "frontend/src/App.tsx": "Main router setup defining all routes, authentication guards, and the root layout wrapped in ThemeProvider.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI card shown when a user lacks permission, with a button linking back to home.",
  "frontend/src/components/auth/AdminGate.tsx": "Component that checks user role and shows admin content, claim-access UI, or access denied.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard redirecting unauthenticated users to login and showing loader during initialization.",
  "frontend/src/components/auth/ClaimAdminAccessScreen.tsx": "Admin login form allowing users to submit credentials and trigger the claim admin mutation.",
  "frontend/src/components/catalog/ProductCard.tsx": "Displays a product card with icon, name, price, and optional auto-delivery badge.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, routed content area, and footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with contact info, social links, and legal navigation.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Main navigation bar handling auth state, links, user menu, and wallet balance display.",
  "frontend/src/components/payments/PaymentMethodModal.tsx": "Modal for submitting mobile payment details including amount and transaction ID.",
  "frontend/src/components/promo/InstallAppBar.tsx": "Dismissible bottom bar prompting users to install the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Admin hooks for fetching and approving or rejecting wallet top‑up transactions with query invalidation.",
  "frontend/src/hooks/useAdminPoints.ts": "Provides admin React Query hooks for managing points transactions, purchase requests, diamond purchases, ad rewards analytics, dashboard stats, and conversion settings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, login, logout, and identity loading with Dfinity AuthClient.",
  "frontend/src/hooks/useOrders.ts": "Defines placeholder order-related hooks that return empty data or errors because backend order methods are not yet implemented.",
  "frontend/src/hooks/usePoints.ts": "Contains hooks for fetching and mutating caller points, transactions, purchase requests, diamond purchases, conversion settings, and ad reward actions.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for fetching products, user profiles, roles, users, and claiming admin access with React Query.",
  "frontend/src/hooks/useTransactions.ts": "Adds a mutation hook for submitting wallet top-up transactions and refreshing related queries.",
  "frontend/src/hooks/useWallet.ts": "Offers hooks to fetch caller wallet balance and wallet transaction history.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, light/dark modes, and custom card-lift component styling.",
  "frontend/src/main.tsx": "Initializes the app by mounting React, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddMoneyPage.tsx": "Page for adding wallet money via mobile payment methods and viewing transaction history.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Admin dashboard showing transactions, orders, users, points data, and tools to approve or reject actions and update settings.",
  "frontend/src/pages/AdRewardsPage.tsx": "Page to watch ads, track daily ad progress, and claim point rewards with error handling.",
  "frontend/src/pages/BuyDiamondsWithPointsPage.tsx": "Page to convert points into diamonds, validate balance, and submit diamond purchase requests.",
  "frontend/src/pages/BuyPointsPage.tsx": "Page to buy points using wallet balance, calculate conversion, and track purchase requests.",
  "frontend/src/pages/ContactUsPage.tsx": "Static contact page providing Telegram and email support information.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing balances, transactions, orders, and a profile setup dialog.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero promo content, feature badges, and a New Offer section with navigation to add money.",
  "frontend/src/pages/IdCodeTopUpPage.tsx": "UI for selecting diamond packages and entering a Free Fire UID, with conditional payment instructions.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity and redirects authenticated users to the dashboard.",
  "frontend/src/pages/RegisterPage.tsx": "Registration screen with disabled form fields that triggers Internet Identity login for account creation.",
  "frontend/src/pages/TopupPage.tsx": "Product selection page that handles top‑up ordering, authentication checks, and special routing for ID Code TopUp.",
  "frontend/src/utils/transactionId.ts": "Generates a unique transaction ID using a timestamp and random string.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params (including hash-based), persisting them in sessionStorage, and clearing them from storage or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining content paths, theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing system features, architecture notes, known issues, and pending feature requests."
}