{
  "kind": "build_request",
  "title": "Redesign A7J TOPUP UI with clean white + purple professional theme",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the global visual theme to a clean professional look: pure white backgrounds, purple accent color #6C5CE7, clean sans-serif typography, consistent sizing/spacing, rounded corners, and soft shadows; remove any dark/gaming/arena styling and heavy gradients across the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Redesign A7J TOPUP website with a clean professional theme.\n\nRequirements:\n1. Background: Pure white\n2. Accent color: Purple (#6C5CE7)\n...\n8. Remove all gaming arena style, dark backgrounds, heavy gradients\n9. Fully responsive and mobile friendly"
        ]
      },
      "acceptanceCriteria": [
        "All primary page backgrounds render as pure white (no dark sections).",
        "Primary interactive elements (buttons/links/highlights) use #6C5CE7 (or theme token mapped to that value).",
        "Gradient-heavy utility classes currently used in UI (e.g., hero overlays, gradient text/buttons, gradient card backgrounds) are removed or replaced with solid/very subtle styles.",
        "Typography is a clean sans-serif site-wide with consistent heading/body scale and spacing.",
        "Cards/sections use rounded corners and soft shadow; no harsh neon/glow effects.",
        "All pages remain readable and visually consistent on mobile and desktop."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Redesign the header/navigation to match: logo on the left, nav links (Home, Add Money, Buy Points, Topup Diamonds, Earn Points), and a wallet balance display; keep the header fully responsive with a mobile menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Header:\n   - Logo on left\n   - Navigation links: Home, Add Money, Buy Points, Topup Diamonds, Earn Points\n   - Wallet balance display\n...\n9. Fully responsive and mobile friendly"
        ]
      },
      "acceptanceCriteria": [
        "Desktop header shows the logo on the left and the specified navigation links in the header.",
        "Mobile header uses a menu/sheet that includes the same navigation links.",
        "Header displays the caller wallet balance (for authenticated users) and updates when wallet balance changes (via existing wallet query invalidation patterns).",
        "Navigation labels match exactly: \"Home\", \"Add Money\", \"Buy Points\", \"Topup Diamonds\", \"Earn Points\".",
        "No gaming-focused tagline remains in the header (replace with neutral/professional wording in English)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Redesign the Home page hero section to be minimal and professional: white background, bold headline, small subtitle, and a clear call-to-action button labeled \"Add Money\" that routes to the Add Money flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hero Section:\n   - White background, bold headline, small subtitle\n   - Call-to-action button (Add Money)\n   - Minimal, professional design\n...\n8. Remove all gaming arena style, dark backgrounds, heavy gradients"
        ]
      },
      "acceptanceCriteria": [
        "Hero section has a pure white background (no background image and no large gradient overlays).",
        "Hero contains a bold headline, a smaller subtitle, and a single primary CTA button labeled \"Add Money\".",
        "CTA navigates to the Add Money page/route.",
        "Hero and above-the-fold layout is responsive and looks clean on mobile and desktop.",
        "Hero copy is in English and avoids gaming-arena tone (no \"Gaming Top-Up\" style messaging)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update all card/section styling used on landing and core pages to use rounded corners, soft shadows, and a white/light-gray palette (no gradient card backgrounds); ensure spacing and layout remain mobile responsive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Cards/Sections:\n   - Rounded corners, soft shadows\n   - Mobile responsive layout\n...\n8. Remove all gaming arena style, dark backgrounds, heavy gradients\n9. Fully responsive and mobile friendly"
        ]
      },
      "acceptanceCriteria": [
        "Cards/sections (including promotional/offer sections on the Home page) use white/light-gray backgrounds, rounded corners, and soft shadows.",
        "Gradient-backed cards/sections are replaced with solid or subtle neutral backgrounds.",
        "Layouts maintain responsiveness (1-column on small screens, multi-column on larger screens where appropriate).",
        "No sections use dark backgrounds or heavy gradients."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Redesign the footer to a light gray background with clear sections for contact info, social links, and terms; keep it responsive and professional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Footer:\n   - Light gray background\n   - Contact info, social links, terms"
        ]
      },
      "acceptanceCriteria": [
        "Footer background is light gray (not dark) and contrasts appropriately with white page background.",
        "Footer includes clearly labeled contact information, social links, and a terms section/link area.",
        "Footer layout is responsive (stacked on mobile, columns on desktop).",
        "All user-facing text in the footer is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources).",
    "Do not edit files listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts).",
    "Backend behavior and data models must remain unchanged; this request is a UI redesign only."
  ],
  "nonGoals": [
    "Implementing or changing wallet/points/diamonds business logic.",
    "Adding new authentication providers (only Internet Identity is supported).",
    "Introducing real-time features (WebSockets/push notifications).",
    "Creating new backend endpoints or changing persistent schema."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing UI text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}