{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Functional Add Money modals (bKash/Nagad) with validated submission and admin list refresh",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Add Money page shows bKash/Nagad payment buttons that open method-specific modals and can be closed without submitting.",
      "acceptanceCriteria": [
        "On /add-money, clicking “Pay with bKash” opens a modal with bKash details.",
        "On /add-money, clicking “Pay with Nagad” opens a modal with Nagad details.",
        "Closing the modal returns the user to the Add Money page without submitting anything."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddMoneyPage.tsx",
          "operation": "modify",
          "description": "Verify the two payment method CTAs reliably open the PaymentMethodModal with the correct method and that closing (X/overlay/escape) resets modal state without triggering submission; keep bKash and Nagad buttons usable on mobile. Use existing shadcn-ui Button + Dialog composition already in place (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/payments/PaymentMethodModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal correctly reflects the incoming method prop (bKash vs Nagad) and supports a non-submitting close interaction that calls onOpenChange(false) (verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the payment modal UI to the requested clean white card design with close (X), method number, 4-step ordered instructions, and purple “Submit Transaction” CTA.",
      "acceptanceCriteria": [
        "Modal surface uses a white background, rounded corners, and a soft shadow (no dark/opaque overlay inside the card).",
        "A close (X) control is visible in the modal’s top-right corner and closes the modal when clicked.",
        "When method=bKash, the modal displays payment number 01868226859; when method=Nagad, it displays 01784377956.",
        "Instructions are displayed as an ordered list with exactly 4 steps (Send money → Enter amount → Enter Transaction ID → Click “Submit Transaction”).",
        "The submit button label is exactly “Submit Transaction” and uses the app’s purple primary styling.",
        "Modal layout is mobile responsive (fits small screens without horizontal scrolling)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PaymentMethodModal.tsx",
          "operation": "modify",
          "description": "Restyle the DialogContent as a clean white rounded card with soft shadow; add an explicit top-right close (X) button inside the modal; render the instructions as an ordered list with exactly 4 steps; keep the primary button label exactly “Submit Transaction” using the existing purple primary styling; ensure responsive layout via constrained width and max-height with scroll for small viewports. Compose using existing shadcn-ui Dialog/Button/Input/Label components (verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Validate modal inputs client-side, submit to backend via existing mutation, and show clear English success/failure messaging.",
      "acceptanceCriteria": [
        "If Transaction ID is empty/whitespace, the form shows an inline error and does not submit.",
        "If amount is missing or <= 0, the form shows an inline error and does not submit.",
        "On successful submission, the user sees a success message in English and the modal closes.",
        "On failure, the user sees a clear English error message and the modal remains open for correction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/payments/PaymentMethodModal.tsx",
          "operation": "modify",
          "description": "Improve client-side validation UX to show inline field-level errors for amount and transaction ID (not just a generic message), blocking submission when invalid; ensure errors are in English and cleared appropriately on change/resubmit (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/AddMoneyPage.tsx",
          "operation": "modify",
          "description": "Ensure handleModalSubmit trims TxID, rejects invalid amount strings before BigInt conversion, calls the existing submit mutation, shows English success/failure feedback (toast is acceptable), closes modal on success, and keeps modal open on failure for correction (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/hooks/useTransactions.ts",
          "operation": "modify",
          "description": "Harden the submission mutation UX by ensuring errors thrown from submitAddMoneyTransaction propagate cleanly to the caller (so the modal can stay open), while keeping success invalidations so the user sees updated history after submission."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Ensure admin transactions list reflects newly submitted pending top-ups and admin actions refresh the list appropriately.",
      "acceptanceCriteria": [
        "After a user submits a top-up request, the transaction appears in the admin transactions list as Pending (after refresh or automatic query invalidation).",
        "Admin users can approve a pending transaction; approval updates status to Approved and credits the user wallet balance.",
        "Admin users can reject a pending transaction; rejection updates status to Rejected and does not credit wallet balance."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTransactions.ts",
          "operation": "modify",
          "description": "After a successful add-money submission, also invalidate the admin wallet top-up list query (e.g., the ['allTransactions'] cache key) so the Admin Panel can reflect newly pending submissions after refresh or automatic invalidation."
        },
        {
          "path": "frontend/src/pages/admin/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Confirm the Wallet tab clearly displays Pending status and that Approve/Reject actions remain available only for pending rows; keep the table usable on mobile via horizontal scrolling where necessary. Admin route access remains protected by the existing authorization system AdminGate/AuthGate wrapper (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/AdminGate.tsx",
          "operation": "modify",
          "description": "Verify admin-only access behavior stays consistent (admin sees panel; non-admin sees claim/access denied) and that authorization failures from backend are presented gracefully in English for admin actions. Use the existing authorization system patterns (verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Maintain a mobile-responsive, professional UI for Add Money page and the payment modal.",
      "acceptanceCriteria": [
        "Add Money page content fits on mobile widths without overlapping elements or requiring horizontal scrolling (except the transaction table which may scroll horizontally as needed).",
        "Buttons are full-width on mobile where appropriate and remain easily tappable.",
        "Modal content fits within the viewport on common mobile sizes and remains readable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddMoneyPage.tsx",
          "operation": "modify",
          "description": "Audit and adjust spacing/typography/button sizing so the payment method sections and transaction history remain readable and tappable on small screens; keep the transaction table scrollable horizontally as needed (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/payments/PaymentMethodModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal card fits small screens by enforcing responsive width, adding max-height with internal scrolling, and keeping form controls and the “Submit Transaction” CTA comfortably tappable (verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}